// 有一個以.跟#組成的迷宮，.是可以走的路，#是牆壁。這迷宮的範圍是 10*10，入口固定在左上角，出口在右下角。

// 現在請你寫一個函式，接收一個用來表示迷宮的陣列，並回傳從入口走到出口最少需要幾步。

// 範例輸入一：

// [
// 	'.#########',
// 	'.........#',
// 	'########.#',
// 	'#........#',
// 	'#.########',
// 	'#........#',
// 	'########.#',
// 	'#........#',
// 	'#.######.#',
// 	'########..'
// ]
// 範例輸入二：

// [
// 	'..########', row1
// 	'#........#', row2
// 	'###..#..##',
// 	'#....#..##',
// 	'#..###...#',
// 	'#.#..#...#',
// 	'#.#....#.#',
// 	'#.####...#',
// 	'#.....#..#',
// 	'########..'   20
// ]

function countStep(arr){
    var step=1;
    var nowcol=9
    var nowrow=9;
    while(nowrow !=0 && nowcol!= 0){

        if(arr[nowrow-1].split("")[nowcol]=="."){
            step++;
            nowrow-=1;
        }else if(arr[nowrow].split("")[nowcol-1]=="."){
            step++;
            nowcol-=1;
        }else if(arr[nowrow].split("")[nowcol+1]=="."){
            step++;
            nowcol+=1;
        }
        
    }

    return step
}


console.log(2)



